# Capturing NAN values with a new feature

It works well if the data are not missing completely at random

In [4]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [8]:
#Creates a new column(Age_Nan), where if (Age) has a Nan value, then (Age_Nan) will have 1 at that index or else 0 at that index

df['Age_NAN']=np.where(df['Age'].isnull(),1,0)

In [9]:
df.head()

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0

In [12]:
df.Age.median()

28.0

In [13]:
#Replacing Nan values of 'Age' with the median value

df['Age'].fillna(df.Age.median(),inplace=True)

In [16]:
#Observe the index where Age_Nan = 1, Age = 28.. (Nan value of Age is replaced with median value)

df.head(10)

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0  28.0   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0